<%@ page language="java" contentType="text/html; charset=UTF-8"
         pageEncoding="UTF-8" %>
<%@ taglib prefix="c" uri="http://java.sun.com/jsp/jstl/core" %>
<div id="container">
    <div><b>ALMOND 개인정보 처리방침</b></div>
    <div>정보통신망 이용촉진 등에 관한 법률 등 관련 법률에 의한 개인정보 보호규정 및 정보통신부가 제정한 개인정보지침을 준수하고 있습니다.</div>
    <br>
    <div><b>1. 개인정보의 수집 항목</b></div>
    <div>원활한 서비스 이용과 고객과의 소통을 위해 수집합니다.</div>
    <div>• 필수항목: 아이디, 비밀번호, 이메일</div>
    <div>• 자동수집항목: IP 주소, 접속 기록, 쿠키 등</div>
    <br>
    <div><b>2. 개인정보의 수집 방법</b></div>
    <div>회원 가입 시에 필수항목 기재를 요청합니다.</div>
    <div><b>3. 개인정보의 수집 이용 목적</b></div>
    <div>• 아이디, 비밀번호, 이메일: 회원 가입시에 사용자확인, 중복가입 방지, 부정 이용 방지를 위한 목적으로 사용합니다.</div>
    <div>• 이용자의 IP 주소, 접속 기록 등: 불량회원의 부정 이용방지와 비인가 사용방지, 통계학적 분석에 사용합니다.</div>
    <br>
    <div><b>4. 개인정보 공유 및 제공</b></div>
    <div>회원의 동의가 있거나 법률의 규정 또는 수사목적으로 법령에 정해진 절차와 방법에 따른 수사기관의 요구에 의한 경우를 제외하고, 어떠한 경우에도 본 방침을 넘어 이용자의 개인정보를 이용하거나 외부에 공개하지 않습니다.</div>
    <div>대한민국 경찰서에서 통신자료제공 요청이 온 경우에는 개인정보를 경찰서에 제공합니다.</div>
    <br>
    <div><b>5. 개인정보의 위탁</b></div>
    <div>회원의 동의 없이 개인정보를 외부에 위탁하지 않습니다.</div>
    <br>
    <div><b>6. 개인정보의 보유 및 이용기간</b></div>
    <div>- 가입 회원정보는 탈퇴할 시 3년간 보관 후 파기됩니다.</div>
    <div>- 단, 게시물 및 댓글의 내용은 사이트 폐쇄 시까지 보관합니다.</div>
    <div>- 악성 사용자 재가입을 막기 위해, 단일 암호화 기법으로 해쉬 방식으로 일부 개인정보의 해쉬를 영구적으로 저장하여 가입 제한을 할 수 있다(이 때 개인정보 자체는 저장되지 않음).</div>
    <br>
    <div><b>7. 개인정보의 파기절차 및 방법</b></div>
    <div>• 파기절차: 가입 회원정보는 탈퇴 후 3년간 보관한 후, 어떠한 용도로도 열람 또는 이용할 수 없도록 파기 처리합니다.</div>
    <div>• 파기 방법: 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.</div>
    <br>
    <div><b>8. 이용자 및 법정대리인의 권리와 그 행사방법</b></div>
    <div>이용자 및 법정 대리인은 언제든지 등록되어 있는 자신 혹은 당해 만 14세 미만 아동의 개인정보를 조회하거나 수정할 수 있으며 가입해지를 요청할 수도 있습니다.</div>
    <br>
    <div><b>9. 쿠키(Cookie)의 설치, 운영 및 거부</b></div>
    <div>• 쿠키: 웹 사이트를 운영하는데 이용되는 서버가 사용자의 브라우저에 보내는 정보 파일로 사용자의 컴퓨터 하드디스크에 저장되기도 합니다.</div>
    <div>• 쿠키 등의 사용 목적: 사이트 로그인을 위한 아이디 식별 및 사이트 설정 기능이 담겨져 있어서 최적화된 정보 제공을 위해 사용합니다.</div>
    <div>• 쿠키 설정 거부 방법: (IE의 경우) 웹 브라우저 상단의 도구>인터넷 옵션> 사이트별 개인정보에서 거부할 수 있습니다.</div>
    <br>
    <div><b>10. 개인정보의 기술적/관리적 보호 대책</b></div>
    <div>이용자들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다.</div>
    <div>• 비밀번호 암호화
        회원 아이디(ID)의 비밀번호는 암호화되어 저장 및 관리되고 있어 본인만이 알고 있으며, 개인정보의 확인 및 변경도 비밀번호를 알고 있는 본인에 의해서만 가능합니다.</div>
    <div>• 해킹 등에 대비한 대책
        해킹이나 컴퓨터 바이러스 등에 의해 회원의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다.</div>
    <br>
    <div><b>11. 개인정보 관리 책임자</b></div>
    <div>- 개인정보 보호업무 부서: ALMOND 운영팀</div>
    <div>- 연락처 및 이메일 : help@almond.com</div>
    <br>
    <div><b>12. 고지의 의무</b></div>
    <div>이 개인정보 취급방침이 법령, 정책 또는 보안기술의 변경에 따라 내용이 추가, 삭제 및 수정될 경우에는 변경사항의 시행일의 7일전부터 사이트에 공고할 것입니다.</div>
    <div>• 공고일자: 2021년 08월 22일</div>
    <div style="margin-bottom: 10px;">• 시행일자: 2021년 08월 22일</div>
    <footer>
        <img src="/img/logo.png" width="120" height="70" class="footImg">
        <div class="copyright">
            <address>
                <span>Copyright © www.almond.com All rights reserved.&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;&emsp;</span>
            </address>
            <div id="about">
                <span>ALMOND 운영팀: help@almond.com | <a href="/about/policy">이용약관</a> | <a href="/about/privacy"><b>개인정보처리방침</b></a></span>
            </div>
        </div>
    </footer>
</div>